#encoding:utf-8
''

'''
-----------------------------------------------------------------------------------------------------------------------------------------------------
#二分查找
[1,3,5,6,8,9]中找到3
-----------------------------------------------------------------------------------------------------------------------------------------------------
'''
# num_list = [1,3,5,6,8,9]
num_list = [-1, 5, 6, 10, 23, 34, 123, 213, 344, 435, 65535]
nums = int(raw_input("%s 请从列表中选择查找的数字:" % num_list))
print nums
mid = len(num_list)/2
while True:
    if mid == 0  :
        print mid
        break
    if nums > num_list[mid]:
        mid = mid + mid/2
    elif nums < num_list[mid]:
        mid = mid - mid/2
    else:
        print mid
        break


'''
#猜数字的游戏
'''


'''
-----------------------------------------------------------------------------------------------------------------------------------------------------
#随机抽取两面同学的作业
-----------------------------------------------------------------------------------------------------------------------------------------------------
'''
import random
name_list = ['靳德瑞', '祁成', '鲍鹏飞', '佘朝辉', '常华伟', '崔佳', '赵云海', '谭帥','李续', '郭云飞', '周福成', '桑鹏亮','赵勇']
'''
#方法一
'''
num1 = random.randint(1,len(name_list)-1)
name1 = name_list[num1]
name_list.pop(num1)
num2 = random.randint(1,len(name_list)-1)
name2 = name_list[num2]
print "本次抽查%s,%s的作业" % (name1,name2)
'''
#方法二
'''
names = random.sample(name_list,2)
print "本次抽查%s,%s的作业" % (names[0],names[1])

'''
-----------------------------------------------------------------------------------------------------------------------------------------------------
#插入排序
    所谓插入排序法，就是检查第i个数字，如果在它的左边的数字比它大，进行交换，这个动作一直继续下去，直到这个数字的左边数字比它还要小，就可以停止了。插入排序法主要的回圈有两个变数：i和j，每一次执行这个回圈，就会将第i个数字放到左边恰当的位置去。
-----------------------------------------------------------------------------------------------------------------------------------------------------
'''
num_list = [23,344,34,5,6,-1,213,65535,123,435,10]
for x in range(0,len(num_list)):
    for y in range(0,x+1):   #每次插入的数据与新的序列中的数做比较
        if num_list[x] < num_list[y]:
            num_list[x],num_list[y] = num_list[y],num_list[x]
print "插入排序",num_list



'''
-----------------------------------------------------------------------------------------------------------------------------------------------------
#选择排序 (请老师帮忙看下这个算法的写法是否正确,我是根据理解自己写的!!!)
    选择排序：比如在一个长度为N的无序数组中，在第一趟遍历N个数据，找出其中最小的数值与第一个元素交换，第二趟遍历剩下的N-1个数据，找出其中最小的数值与第二个元素交换......第N-1趟遍历剩下的2个数据，找出其中最小的数值与第N-1个元素交换，至此选择排序完成。
-----------------------------------------------------------------------------------------------------------------------------------------------------
'''
num_list = [23,344,34,5,6,-1,213,65535,123,435,10]

for i in range(0,len(num_list)-1):  #循环次数
    index = i
    for x in range(i+1,len(num_list)):
        if num_list[index] > num_list[x]:   #找到最小的数
            index = x
    # print num_list[i],num_list[index] #调试用,为了查看对比的结果
    num_list[i],num_list[index] = num_list[index],num_list[i]   #将最小的数与当前队列第一个做交换
print "选择排序",num_list


'''
-----------------------------------------------------------------------------------------------------------------------------------------------------
#冒泡排序
    它重复地走访过要排序的数列，一次比较两个元素，如果他们的顺序错误就把他们交换过来。走访数列的工作是重复地进行直到没有再需要交换，也就是说该数列已经排序完成
-----------------------------------------------------------------------------------------------------------------------------------------------------
'''
num_list = [23,344,34,5,6,-1,213,65535,123,435,10]
for x in range(0,len(num_list)-1):  #循环次数
    for y in range(0,len(num_list)-1-x):
        if num_list[y] > num_list[y+1]:    #每两个比较
            num_list[y],num_list[y+1] = num_list[y+1],num_list[y]    #对调

print "冒泡排序",num_list


'''
-----------------------------------------------------------------------------------------------------------------------------------------------------
#其他排序(个人理解是冒泡排序)(请老师帮忙看下!!!)
-----------------------------------------------------------------------------------------------------------------------------------------------------
'''
num_list = [23,344,34,5,6,-1,213,65535,123,435,10]
for i in range(0,len(num_list)):
    for j in range(i+1,len(num_list)):
        if num_list[i] > num_list[j]:
            num_list[i],num_list[j] = num_list[j],num_list[i]
print "其他排序",num_list

'''
-----------------------------------------------------------------------------------------------------------------------------------------------------

-----------------------------------------------------------------------------------------------------------------------------------------------------
'''